---
kind: method
id: M:Autodesk.Revit.DB.RenderingQualitySettings.IsValidRenderLevel(System.Int32)
source: html/1ce8c60b-cc6a-d15c-8e63-30419e5750b7.htm
---
# Autodesk.Revit.DB.RenderingQualitySettings.IsValidRenderLevel Method

Validate the render level is between 1 and 40

## Syntax (C#)
```csharp
public bool IsValidRenderLevel(
	int value
)
```

## Parameters
- **value** (`System.Int32`) - The render level value to validate.

## Returns
True if the render level value is in the proper range, false otherwise.